program pot;
var
a: array[0..15] of integer;
b: array[0..15] of string;
begin 
write('Добро поажловать в игру здесь вам понадобиться собрать определенное количество токенов и за них купить себе, то что вам понадобится в битве с босом');
Sleep(40);
write('Первый вопрос. Когда началась вьтнамская война?(год)');
read(a[0])


case a[0] of
1955: a[4]:=a[1]+10;
else a[4]:=0;
end;


 


 
case a[0] of
1955:  Writeln('поздравляю ты угадал,теперь у тебя 10 токенов');
else writeln('ну ты и лох, тебе дизреспект от жоры, и у тебя 0 токенов лоххх');
 end;
 writeln('у тебя');
writeln(a[4]);
writeln('токенов');
 writeln('теперь второй вопрос,когда нужно ходить в университет?');
 writeln(' 1 - каждый день'
          ' 2 - три дня в неделю'
          ' 3 - когда есть смысл в этом передвежении с одной точки в другую'
          ' 4 - что такое универ?');
          read(a[2]);// ответ второй вопрос 
         
 case a[2] of
3: a[3]:= a[4]+10;
else a[3]:=a[419]+0;// 2 количество токенов
end;
case a[2] of
1:  Writeln('люди пиздим его ');
2:  Writeln('давай еще немного и ты станешь избранным  ');
3:  Writeln('да ты наш человек, молодец держи свои 10 токенов  ');
4:  Writeln('ну и пиздуй от сюда ')
else writeln('у тебя проблемы с восприятием этого мира');
end;
writeln('у тебя');
write(a[3]);
write('токенов');



Writeln('Кого стоит больше бояться?');
writeln(' 1 - Голодного медведя '
          ' 2 - Злого тигра '
          ' 3 - Бабу из донецка которой сказали что она жирная'
          ' 4 - Гейба когда ему скаазли что 30% это много);
          read(a[5]);// 3 ответ 

case a[5] of
3: a[6]:= a[3]+10;
else a[6]:=a[3]+0;// 3 количество токенов
end;
case a[5] of
1:  Writeln('хули нам анимешникам меч в анал и нет медведя');
2:  Writeln('это же неко тян  ');
3:  Writeln(' тебе будет проще выброситься из окна, но в загробном мире она тебя тоже найдет  ');
4:  Writeln(' уже есть EpicGames ')
else writeln('ты по правилам играй');
end;
writeln('у тебя');
write(a[6]);
write('токенов');




 

 end.
 
